Repository: mp-se/brewflasher
Catalog: locales/*/LC_MESSAGES/brewflasher.po
Languages: es, no, sv

source: BrewFlasher is translated by users like you! If you can suggest any improvements please create an issue on GitHub at http://github.com/thorrak/brewflasher/issues/
es: ¡BrewFlasher es traducido por usuarios como tú! Si puedes sugerir alguna mejora, por favor crea un issue en GitHub en http://github.com/thorrak/brewflasher/issues/
no: BrewFlasher oversettes av brukere som deg! Hvis du kan foreslå forbedringer, vennligst opprett en sak på GitHub på http://github.com/thorrak/brewflasher/issues/
sv: BrewFlasher översätts av användare som du! Om du kan föreslå några förbättringar, skapa gärna en fråga på GitHub på http://github.com/thorrak/brewflasher/issues/

source: Auto-select
es: Autoseleccionar
no: Automerking
sv: Automatiskt val

source: (first port with Espressif device)
es: (primer puerto con dispositivo Espressif)
no: (første port med Espressif enhet)
sv: (första porten med Espressif enhet)

source: Must select the project, device family, and firmware to flash before flashing.
es: Debe seleccionar el proyecto, la familia de dispositivos y el firmware a flashear antes de realizar el flasheo.
no: Må velge prosjekt, enhetsfamilie og firmware før flashing.
sv: Du måste välja projekt, enhetstyp och mjukvara att programmera innan start.

source: Verifying firmware list is up-to-date before downloading...
es: Verificando que la lista de firmware esté actualizada antes de descargar...
no: Verifiserer firmwarelisten er oppdatert før nedlasting...
sv: Verfierar att listan på mjukvara är uppdaterad innan nedladdning...

source: Firmware list is not up to date.
es: La lista de firmware no está actualizada.
no: Firmware listen er ikke oppdatert.
sv: Listan med mjukvara är inte uppdaterad.

source: Relaunch BrewFlasher and try again.
es: Vuelve a abrir BrewFlasher e intente nuevamente.
no: Restart BrewFlasher og prøv igjen.
sv: Starta om BrewFlasher och försök igen.

source: Downloading firmware...
es: Descargando firmware...
no: Laster ned firmware...
sv: Laddar ned mjukvara...

source: Error - unable to download firmware.
es: Error - no se pudo descargar el firmware.
no: Feil - kunne ikke laste ned firmware.
sv: Fel - kan inte ladda ner mjukvara.

source: Downloaded successfully!
es: ¡Descarga completa!
no: Nedlasting vellykket!
sv: Nedladdning lyckades!

source: Invalid device family detected.
es: Se ha detectado una familia de dispositivos inválida.
no: Ugyldig enhetsfamilie oppdaget.
sv: Felaktiv enhetstyp detekterades.

source: ERROR - Cannot automatically select the serial port for this device family. Please explicitly select the correct device to continue.
es: ERROR - No se puede seleccionar automáticamente el puerto serie para esta familia de dispositivos. Por favor, seleccione explícitamente el dispositivo correcto para continuar.
no: FEIL - Kan ikke automatisk velge seriell porten for denne enhetsfamilien. Vennligst velg riktig enhet for å fortsette.
sv: FEL - Kan inte automatiskt välja seriell port for denna enhetstyp. Var vänlig och välj rätt seriell enhet for att fortsätta.

source: Invalid flash method detected. Update BrewFlasher and try again.
es: Se detectó un método de flasheo inválido. Actualiza BrewFlasher e intenta nuevamente.
no: Ugyldig flash-metode oppdaget. Oppdater BrewFlasher og prøv igjen.
sv: Ogiltig flashmetod upptäckt. Uppdatera BrewFlasher och försök igen.

source: Performing 1200 bps touch
es: Realizando toque de 1200 bps
no: Utfører 1200 bps test
sv: Utför 1200bps kommando

source: ...done
es: ...hecho
no: ...ferdig
sv: ...klart

source: ...unable to perform 1200bps touch.
es: ...no se puede tocar 1200bps.
no: ...kan ikke gjøre 1200bps test.
sv: ...kunde inte utföra 1200bps kommando.

source: Make sure you have selected the correct serial port (auto-select will not work for this chip) and try again.
es: Asegúrese de haber seleccionado el puerto serie correcto (la opción de selección automática no funcionará para este chip) e intente nuevamente.
no: Sørg for at du har valgt riktig seriell port (automerking fungerer ikke for denne chipen) og prøv igjen.
sv: Säkerställ att du har valt den rätta serialla porten (automatiskt val fungerar inte för denna enhetstyp) och försök igen.

source: Alternatively, you may need to manually set the device into 'flash' mode.
es: Alternativamente, puede que necesite configurar manualmente el dispositivo en modo 'flash'.
no: Alternativt kan du manuelt sette enheten i "flash" modus.
sv: Som alternativ kan du sätta enheten i 'programmerings' läge.

source: For instructions on how to do this, check this website: http://www.brewflasher.com/manualflash/
es: Para obtener instrucciones sobre cómo hacerlo, consulte este sitio web: http://www.brewflasher.com/manualflash/
no: For instruksjoner om hvordan du skal gjøre dette, se denne siden: http://www.brewflasher.com/manualflash/
sv: För instruktioner om hur man gör detta, kontrollera denna webbplats: http://www.brewflasher.com/manualflash/

source: Firmware flashing FAILED. {tool} raised an error.
es: El flashing del firmware FALLÓ. {tool} ha producido un error.
no: Firmware flashing FEILET. {tool} utløste en feil.
sv: Mjukvaru-uppdatering MISSLYCKADES. {tool} returnerade ett fel.

source: Try flashing again, or try flashing with a slower speed.
es: Intente flashear de nuevo, o intente flashear con una velocidad más lenta.
no: Prøv å flashe igjen, eller prøv å flashe med en lavere hastighet.
sv: Försök programmera igen, försök med en lägre hastighet.

source: Firmware successfully flashed. Reset device to switch back to normal boot mode.
es: Firmware flasheado exitosamente. Reinicie el dispositivo para volver al modo de arranque normal.
no: Firmware flashet. Reset enheten for å bytte tilbake til normal boot modus.
sv: Programmering lyckades. Starta om enheten för att återgå till normalt läge.

source: Connect your device
es: Conecte su dispositivo
no: Koble til enheten din
sv: Anslut din enhet

source: If you chose the serial port auto-select feature you might need to turn off Bluetooth
es: Si eligió la función de autoselección de puerto serie puede que necesite desactivar Bluetooth
no: Hvis du valgte seriell port automerk funksjonen må du muligens slå av Bluetooth
sv: Om du väljer en seriell port med automatiskt val så kanske du behöver stänga av Bluetooth

source: Avrdude was not found. Arduino firmware cannot be flashed.
es: Avrdude no fue encontrado. No se puede flashear el firmware de Arduino.
no: Avrdude ble ikke funnet. Arduino-firmware kan ikke flashes.
sv: Avrdude hittades inte. Arduino firmware kan inte flashas.

source: To install Avrdude, follow the instructions at https://github.com/avrdudes/avrdude/
es: Para instalar Avrdude, sigue las instrucciones en https://github.com/avrdudes/avrdude/
no: For å installere Avrdude, følg instruksjonene på https://github.com/avrdudes/avrdude/
sv: För att installera Avrdude, följ instruktionerna på https://github.com/avrdudes/avrdude/

source: Reload serial device list
es: Recargar lista de dispositivos seriales
no: Oppdater seriell enhetsliste
sv: Ladda om listan med seriella enheter

source: no
no: nei
sv: nej

source: yes, wipes all data
es: sí, borra todos los datos
no: ja, sletter all data
sv: ja, radera all data

source: Download Firmware and Flash Controller
es: Descargar Firmware y Flash Controller
no: Last ned Firmware og Flash-kontroller
sv: Ladda ner mjukvara och programmera enhet

source: Serial port
es: Puerto serie
no: Seriell port
sv: Serieport

source: Project
es: Proyecto
no: Prosjekt
sv: Projekt

source: Device Family
es: Familia de dispositivos
no: Enhetsfamilie
sv: Enhetstyp

source: Firmware
sv: Mjukvara

source: Baud rate
es: Velocidad de transmisión en baudios
no: Overføringshastighet
sv: Seriell hastighet

source: Erase flash
es: Borrar flash
no: Slett flash
sv: Radera enhet

source: Console
es: Consola
no: Konsoll
sv: Konsoll

source: Welcome to BrewFlasher {version}
es: Bienvenido a BrewFlasher {version}
no: Velkommen til BrewFlasher {version}
sv: Välkommen till BrewFlasher {version}

source: Exit BrewFlasher
es: Salir de BrewFlasher
no: Avslutt BrewFlasher
sv: Avsluta BrewFlasher

source: About
es: Acerca De
no: Om
sv: Om
